A622266/micropython/ports/mimxrt/machine_spi.c
    return MP_OBJ_FROM_PTR(self);
}

static void machine_spi_init(mp_obj_base_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_baudrate, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit, ARG_gap_ns };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_baudrate, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_gap_ns,   MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };

    // Parse the arguments.
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Reconfigure the baudrate if requested.
    if (args[ARG_baudrate].u_int != -1) {
        self->master_config->baudRate = args[ARG_baudrate].u_int;
        self->master_config->betweenTransferDelayInNanoSec = 1000000000 / self->master_config->baudRate * 2;
    }
    // Reconfigure the format if requested.
    if (args[ARG_polarity].u_int != -1) {
        self->master_config->cpol = args[ARG_polarity].u_int;
    }
    if (args[ARG_phase].u_int != -1) {
        self->master_config->cpha = args[ARG_phase].u_int;
    }
    if (args[ARG_bits].u_int != -1) {
        self->master_config->bitsPerFrame = args[ARG_bits].u_int;
    }
    if (args[ARG_firstbit].u_int != -1) {
        self->master_config->direction = args[ARG_firstbit].u_int;
    }
    if (args[ARG_gap_ns].u_int != -1) {
        self->master_config->betweenTransferDelayInNanoSec = args[ARG_gap_ns].u_int;
    }
    self->master_config->lastSckToPcsDelayInNanoSec = self->master_config->betweenTransferDelayInNanoSec;
    self->master_config->pcsToSckDelayInNanoSec = self->master_config->betweenTransferDelayInNanoSec;
    LPSPI_Enable(self->spi_inst, false);  // Disable first before new settings are applies
    LPSPI_MasterInit(self->spi_inst, self->master_config, BOARD_BOOTCLOCKRUN_LPSPI_CLK_ROOT);
}

static void machine_spi_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;

    if (len > 0) {
        // Wait a short while for the previous transfer to finish, but not forever
        for (volatile int j = 0; (j < 5000) && ((self->spi_inst->SR & kLPSPI_ModuleBusyFlag) != 0); j++) {}

        lpspi_transfer_t masterXfer;
        masterXfer.txData = (uint8_t *)src;
        masterXfer.rxData = (uint8_t *)dest;
        masterXfer.dataSize = len;
        masterXfer.configFlags = (self->master_config->whichPcs << LPSPI_MASTER_PCS_SHIFT) | kLPSPI_MasterPcsContinuous | kLPSPI_MasterByteSwap;

        if (LPSPI_MasterTransferBlocking(self->spi_inst, &masterXfer) != kStatus_Success) {
            mp_raise_OSError(EIO);
        }
    }
}

// Forward declaration -- defined further down with the rest of the periodic-DMA
// implementation, but must be wired into machine_spi_p (right below) so a plain
// spi.deinit() (or garbage collection reclaiming an abandoned SPI object -- a real
// scenario given this project's habit of re-running bench scripts repeatedly in the
// same mpremote/REPL session) actually releases all the DMA channels and stops all the
// PIT channels this extension uses, instead of leaking them silently. Before this,
// machine_spi_p had no .deinit at all (generic machine_spi_deinit() in extmod/
// machine_spi.c already no-ops when it's NULL) -- a pre-existing gap this patch also
// closes as a side effect.
static void machine_spi_deinit_hw(mp_obj_base_t *self_in);

static const mp_machine_spi_p_t machine_spi_p = {
    .init = machine_spi_init,
    .deinit = machine_spi_deinit_hw,
    .transfer = machine_spi_transfer,
};

// --- Periodic DMA transfer implementation ---
// See the module-level comment block near the top of this file for the verified
// hardware facts this depends on, and what's still open.

// TCD storage for the periodic-DMA channel. Only one SPI(id) can run dma_periodic_start()
// at a time in this implementation (see SPI_DMA_PIT_CHANNEL's own comment), so a single
// static TCD suffices -- mirrors machine_i2s.c's AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t
// edmaTcd[I2S_NUM_OBJ_SLOTS], 32) pattern, sized 1 instead of I2S_NUM_OBJ_SLOTS.
AT_NONCACHEABLE_SECTION_ALIGN(static edma_tcd_t spi_dma_tcd, 32);

// Diagnostic-only counter (2026-09-06): increments unconditionally, at ISR level, every
// time this callback runs at all -- independent of whether mp_sched_schedule() actually
// gets serviced by the Python side. Used to separate "the eDMA interrupt never fires" from
// "it fires but the scheduled Python callback never runs" after a sweep test found
// refill() only ever called twice (the initial manual primes) in a 30s run.
volatile uint32_t spi_dma_isr_count = 0;

static void edma_spi_periodic_callback(edma_handle_t *handle, void *userData, bool transferDone, uint32_t tcds) {
    spi_dma_isr_count++;
    machine_spi_obj_t *self = (machine_spi_obj_t *)userData;
    if (self->dma_refill_callback != MP_OBJ_NULL && self->dma_refill_callback != mp_const_none) {
        // transferDone == true means the eDMA major loop just wrapped, i.e. the bottom
        // half was the one just drained (mirrors edma_i2s_callback's own TOP_HALF/
        // BOTTOM_HALF convention in machine_i2s.c) -- pass which half needs refilling,
        // not which half just played, so the Python-side callback can call
        // dma_periodic_write() directly on the right half without re-deriving this.
        mp_sched_schedule(self->dma_refill_callback,
            MP_OBJ_NEW_SMALL_INT(transferDone ? 0 : 1));
    }
}

// Diagnostic-only counter, same idea as spi_dma_isr_count above: how many times the
// I/O_UPDATE ISR has actually fired, independent of anything else.
volatile uint32_t spi_dma_io_update_isr_count = 0;

// LPSPI4's Frame-Complete interrupt handler -- overrides the .weak default in
// startup_MIMXRT1062.S (standard bare-metal override-by-strong-symbol pattern; no
// NVIC_SetVector() call needed, matches how e.g. machine_uart.c's LPUART IRQ handlers
// work in this same port). Fires once per completed SPI frame (LPSPI's own Frame
// Complete flag, FCF: "PCS has negated" per the i.MX RT1060 RM Table 48-6) -- this IS
// the actual event I/O_UPDATE needs to follow, not a guess at when it might happen; see
// dma_periodic_start()'s own I/O_UPDATE comment for why this replaced the earlier
// PIT-timed mechanisms. Deliberately minimal: clear the flag, pulse the pin, return --
// this runs at 192kHz in the target application, so every extra instruction here is
// direct, permanent overhead against the DSP pipeline's cycle budget.
//
// This whole ISR only exists because this SPI object had dma_periodic_start() called
// with io_update_duty_u16 > 0 -- if some OTHER, unrelated code enabled LPSPI4's frame-
// complete interrupt for its own purposes while this feature is also active, the two
// would collide (this handler unconditionally treats every LPSPI4 frame-complete as "an
// AD9910 register frame just finished, pulse I/O_UPDATE"). Not a concern for this
// project (SPI(0)/LPSPI4 is dedicated to the phase path), but a real constraint if this
// pattern is ever reused for a different SPI(0) use case at the same time.
void LPSPI4_IRQHandler(void) {
    LPSPI_ClearStatusFlags(LPSPI4, (uint32_t)kLPSPI_FrameCompleteFlag);
    // Dummy read-back immediately after the write-1-to-clear write, before doing
    // anything else -- bench-found bug (2026-09-07): without this, the M2K digital
    // capture showed I/O_UPDATE toggling at EXACTLY 2x the real frame rate (384 rising
    // edges against 192 real CS-low pulses in the same 1ms window). Root cause: the SR
    // write is posted on the bus and doesn't necessarily complete before the ISR
    // returns; if the NVIC re-samples LPSPI4's IRQ line before the peripheral has
    // actually registered the clear, it sees FCF still asserted and re-enters this ISR
    // immediately for the same underlying event, toggling I/O_UPDATE a second, spurious
    // time. This is a standard ARM/Cortex-M idiom for W1C peripheral status registers --
    // a read-back forces the preceding write to complete before proceeding, rather than
    // leaving it in flight when the ISR exits.
    (void)LPSPI4->SR;
    spi_dma_io_update_isr_count++;
    SPI_DMA_IO_UPDATE_GPIO_BASE->DR_SET = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
    // AD9910's own I/O_UPDATE minimum pulse width is only ">1 SYNC_CLK cycle" (datasheet,
    // I/O_UPDATE/PROFILE[2:0] Timing Characteristics) -- a handful of nanoseconds, far
    // less than the instructions between the two GPIO writes above/below already take at
    // 600MHz. No explicit delay loop is needed; kept implicit rather than adding a NOP
    // loop whose "safe" iteration count would itself be an unverified guess.
    SPI_DMA_IO_UPDATE_GPIO_BASE->DR_CLEAR = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
}

