A622266/micropython/ports/mimxrt/machine_spi.c
// spi.dma_periodic_start(frame_bytes, rate_hz, refill_callback, io_update_duty_u16=0,
//                         io_update_phase_ticks=0)
//
// Starts a PIT/eDMA-driven periodic transfer of `frame_bytes`-sized frames from an
// internal double-buffer into this SPI object's LPSPI TDR register at `rate_hz`, and an
// I/O_UPDATE pulse on pin D15 at the same rate -- generated by two MORE PIT channels
// (sharing the same PERCLK root as the SPI-triggering channel, see the module comment)
// driving GPIO1 directly via eDMA, not TMR3's PWM.
// `refill_callback(half)` is scheduled (via mp_sched_schedule, i.e. run on the main
// thread, not from IRQ context) each time a half-buffer has just been drained and needs
// fresh frames written into it via dma_periodic_write(half, buf).
//
// `io_update_duty_u16` is the I/O_UPDATE pulse width as a fraction of the full period
// (0..65535 maps to 0..rate_hz's period); 0 means "no I/O_UPDATE pulse is generated,"
// i.e. this call alone is NOT sufficient for a working DDS update path. `io_update_
// phase_ticks` is the rising-edge delay in PIT ticks from the same start reference the
// SPI-triggering channel counts from; 0 picks a default (80% of the period) rather than
// a caller-required value, but that default is NOT bench-derived -- see the module
// comment's open-items list. The clock-DOMAIN drift problem this design replaces (PIT
// vs. TMR3/QTMR, confirmed on the bench 2026-09-06) is fixed by construction now: only
// the exact tick counts remain a bench-tuning question, not whether the two stay locked.
static mp_obj_t machine_spi_dma_periodic_start(size_t n_args, const mp_obj_t *args) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    mp_int_t frame_bytes = mp_obj_get_int(args[1]);
    mp_int_t rate_hz = mp_obj_get_int(args[2]);
    mp_obj_t refill_callback = args[3];
    mp_int_t io_update_duty_u16 = (n_args > 4) ? mp_obj_get_int(args[4]) : 0;
    mp_int_t io_update_phase_ticks = (n_args > 5) ? mp_obj_get_int(args[5]) : 0;

    if (self->dma_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("dma_periodic already active"));
    }
    if (frame_bytes <= 0 || frame_bytes > 16) {
        mp_raise_ValueError(MP_ERROR_TEXT("frame_bytes out of range"));
    }

    self->dma_frame_bytes = (size_t)frame_bytes;
    size_t half_bytes = SPI_DMA_FRAMES_PER_HALF * self->dma_frame_bytes;
    size_t total_bytes = 2 * half_bytes;

    // +0x1f for D-cache-line alignment slack, same as machine_i2s.c's dma_buffer field;
    // AT_NONCACHEABLE_SECTION_ALIGN is not used here because size is only known at this
    // point (frame_bytes is caller-specified), unlike the fixed-size TCD above -- this
    // buffer instead needs an explicit cache-maintenance call before each DMA-visible
    // write -- confirmed necessary by bench test (2026-09-06): a frequency-sweep test
    // wrote genuinely changing content via dma_periodic_write() on every refill (verified
    // via the Teensy's own debug log), but the DDS output never changed, stuck at
    // whatever the very first write happened to leave in RAM -- exactly the D-cache
    // staleness this TODO predicted (CPU writes land in cache, DMA reads RAM directly,
    // never sees the update without an explicit clean).
    self->dma_buffer = m_new(uint8_t, total_bytes + 0x1f);
    self->dma_buffer_dcache_aligned = (uint8_t *)(((uint32_t)self->dma_buffer + 0x1f) & ~0x1f);
    memset(self->dma_buffer_dcache_aligned, 0, total_bytes);
    DCACHE_CleanByRange((uint32_t)self->dma_buffer_dcache_aligned, (uint32_t)total_bytes);

    self->dma_refill_callback = refill_callback;

    // --- PIT channel 0: unconditional periodic trigger pulse. Its DOWNSTREAM routing
    // (DMAMUX's dedicated periodic-trigger path, not XBARA1 -- see SPI_DMA_DMAMUX_
    // CHANNEL's own comment above) is configured further below, after DMAMUX/eDMA are
    // initialized.
    pit_config_t pit_config;
    PIT_GetDefaultConfig(&pit_config);
    PIT_Init(PIT, &pit_config);
    uint32_t perclk_hz = CLOCK_GetPerClkFreq();
    uint32_t pit_ticks = perclk_hz / (uint32_t)rate_hz;
    if (pit_ticks == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("rate_hz too high to represent on PIT"));
    }
    PIT_SetTimerPeriod(PIT, SPI_DMA_PIT_CHANNEL, pit_ticks);

    // DMAMUX and eDMA (DMA0) must both be initialized before ANY channel is touched --
    // moved up here (both idempotent, DMAMUX_Init() resets/enables the whole module and
    // dma_init() itself is internally guarded against being called twice) because the
    // I/O_UPDATE block below now also allocates/configures two eDMA channels, and this
    // was originally placed further down, after that block -- a real bug found on the
    // bench (2026-09-06 revision 2): with initialization still below, the I/O_UPDATE
    // channels' EDMA_CreateHandle()/DMAMUX_SetSource() calls ran against an
    // uninitialized DMAMUX/DMA0, hanging the board before dma_periodic_start() could
    // ever return.
    dma_init();
    DMAMUX_Init(DMAMUX);

    // --- SPI trigger: DMAMUX channel 0's periodic-trigger feature, gating LPSPI4's own
    // TX-FIFO-not-full DMA request against PIT channel 0 -- see SPI_DMA_DMAMUX_CHANNEL's
    // own comment above for why (i.MX RT1060 RM section 5.4.1's own documented
    // mechanism, replacing the XBARA1-routed fake-request version that bench-testing
    // found fires multiple frames per trigger once frame_bytes > 1). DMAMUX channel 0 is
    // NOT drawn from allocate_dma_channel()'s general pool -- it and channels 1-3 are
    // permanently reserved there specifically because only these first 4 channels have
    // this hardware feature, and the RM's own fixed table (eDMA channel N <-> PIT
    // channel N) requires channel 0 to pair with PIT channel 0, which is already
    // SPI_DMA_PIT_CHANNEL above.
    DMAMUX_SetSource(DMAMUX, SPI_DMA_DMAMUX_CHANNEL, SPI_DMA_LPSPI4_TX_DMAMUX_SRC);
    DMAMUX_EnableChannel(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    DMAMUX_EnablePeriodTrigger(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    LPSPI_EnableDMA(self->spi_inst, kLPSPI_TxDmaEnable);

    // --- I/O_UPDATE on pin D15, via LPSPI4's own Frame-Complete interrupt (2026-09-07,
    // THIRD revision -- see the module-level comment above for the full history: TMR3
    // PWM had cross-clock-domain drift; PIT+XBARA1+eDMA-GPIO-toggle was driftless but
    // still a BLIND, statically-timed guess at when the SPI frame would finish, and
    // bench testing found DMAMUX's own trigger-to-transfer latency jitters enough
    // (cycling through states whose worst case exceeds one whole PIT period) that NO
    // fixed phase offset can be guaranteed safe -- confirmed on the bench, not derived
    // from a datasheet table, since the RM itself only says trigger-to-transfer latency
    // "cannot be guaranteed," not by how much.
    //
    // This revision ties I/O_UPDATE directly to the ACTUAL event it needs to follow --
    // LPSPI's own Frame Complete flag (FCF), defined in the i.MX RT1060 RM (Table 48-6)
    // as "Frame complete, PCS has negated" -- instead of a statically-computed delay.
    // This is correct BY CONSTRUCTION regardless of DMAMUX's latency jitter, since it
    // fires exactly when the frame the caller cares about has actually finished, not
    // some fixed time after the frame was nominally requested.
    //
    // FCF has NO DMA-request capability (RM Table 48-6 lists only TDF/RDF as DMA-request
    // -capable flags) and the LPSPI IP block's own "frame output trigger" (RM section
    // 48.3.5.1) -- which asserts exactly at PCS negation, in principle routable to other
    // peripherals -- is NOT wired to anything on this specific chip (checked: absent
    // from both the DMAMUX source table, RM section 4.4, and the XBAR1 input table, RM
    // section 4.6). So there is no CPU-free hardware path from "frame complete" to a
    // GPIO toggle on this SoC -- an actual CPU interrupt is required. AD9910's own
    // timing budget makes this comfortable: I/O_UPDATE's minimum pulse width is only
    // ">1 SYNC_CLK cycle" and setup/hold times are 0-1.75ns (AD9910 datasheet,
    // I/O_UPDATE/PROFILE[2:0] Timing Characteristics) -- trivial for even a few Cortex-M7
    // instructions to satisfy, and Cortex-M7 ISR entry/exit latency (order of 10-20
    // cycles) is a tiny fraction of the 5.2us/sample budget at 192kHz.
    //
    // io_update_duty_u16 == 0 keeps the previous "no I/O_UPDATE pulse generated"
    // behavior. Any nonzero value now just means "enabled" -- the exact numeric duty
    // value no longer sets a timed pulse width (there is no timer involved any more);
    // the ISR's own short, fixed instruction sequence between DR_SET and DR_CLEAR is the
    // pulse width. io_update_phase_ticks is accepted for call-site compatibility but is
    // now meaningless (there is no phase to tune -- I/O_UPDATE fires when the frame
    // actually completes, not at a caller-guessed offset) and is otherwise unused.
    (void)io_update_phase_ticks;
    if (io_update_duty_u16 > 0) {
        // D15 as plain GPIO output (ALT5, GPIO1 bit 19) instead of QTIMER3_TIMER3 -- see
        // the module comment for the pin-mux fact this depends on. Same
        // SetPinMux+SetPinConfig pairing as lpspi_set_iomux() (a real bug -- a missing
        // SetPinConfig call -- was found and fixed on the earlier TMR3-based version of
        // this, and this keeps that fix's pairing rather than repeating the gap).
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U);
        IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, DEFAULT_SPI_DRIVE, 0x401F82F8U));
        SPI_DMA_IO_UPDATE_GPIO_BASE->GDIR |= (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
        SPI_DMA_IO_UPDATE_GPIO_BASE->DR_CLEAR = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT); // start low

        // Clear any stale FCF (write-1-to-clear status register) before enabling the
        // interrupt, so a frame completed earlier (e.g. during the priming blocking
        // write this call's precondition requires) doesn't cause an immediate spurious
        // firing the instant the interrupt is unmasked.
        LPSPI_ClearStatusFlags(self->spi_inst, (uint32_t)kLPSPI_FrameCompleteFlag);
        LPSPI_EnableInterrupts(self->spi_inst, (uint32_t)kLPSPI_FrameCompleteInterruptEnable);
        EnableIRQ(LPSPI4_IRQn);
    }

    // --- LPSPI frame-size fixup: a single AD9910/9952/9954 register write is one
    // instruction byte + N payload bytes inside ONE continuous chip-select-low window
    // (the datasheet's own serial-port timing diagram), not N+1 separate one-byte
    // transactions. Left at whatever FRAMESZ a normal machine.SPI.write() call last
    // configured (LPSPI defaults effectively to one CS pulse per 8 bits), the DMA path
    // below would toggle PCS after every single byte instead of once per whole frame --
    // almost certainly misinterpreted by the DDS as N+1 separate short writes rather
    // than one real register write. Fixed by widening just the FRAMESZ field so hardware
    // holds PCS low across the whole frame_bytes*8-bit frame, auto-toggling it only
    // between frames.
    //
    // Deliberately a read-modify-write of TCR's existing value, not a from-scratch
    // reconstruction: TCR also carries CPOL/CPHA/PRESCALE/PCS-select/byte-swap, and
    // LPSPI_MasterInit() does not appear to fully populate TCR itself (those fields seem
    // to only get set for real when a transfer actually runs) -- so this call has a real
    // PRECONDITION: at least one ordinary spi.write()/write_readinto() must already have
    // succeeded on this object before dma_periodic_start() is called, so TCR already
    // holds this project's correct working CPOL/CPHA/byte-order configuration from that
    // call, and this code only widens FRAMESZ on top of it rather than guessing those
    // other fields from scratch (guessing PRESCALE's encoding or BYSW independently was
    // judged a worse risk than requiring this precondition). NOT bench-verified that this
    // read-modify-write approach actually produces correct multi-byte bit ordering on the
    // wire -- see the module comment's open-items list; capture with the ADALM2000 and
    // compare against a known-good blocking-mode write of the same register before
    // trusting this.
    uint32_t frame_bits = (uint32_t)self->dma_frame_bytes * 8;
    self->spi_inst->TCR = (self->spi_inst->TCR & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_FRAMESZ(frame_bits - 1);

    // --- eDMA: PIT-triggered (via DMAMUX's periodic-trigger gate, see above), ring
    // buffer -> LPSPI TDR, self-linked TCD for continuous circular operation (same
    // construct machine_i2s.c uses). self->dma_channel is the FIXED
    // SPI_DMA_DMAMUX_CHANNEL configured above, not drawn from allocate_dma_channel() --
    // DMAMUX_Init()/dma_init() already ran above too, not repeated here.
    self->dma_channel = SPI_DMA_DMAMUX_CHANNEL;

    EDMA_CreateHandle(&self->dma_edmaHandle, DMA0, self->dma_channel);
    EDMA_SetCallback(&self->dma_edmaHandle, edma_spi_periodic_callback, self);
    EDMA_ResetChannel(DMA0, self->dma_channel);
    self->dma_edmaTcd = &spi_dma_tcd;

    // Per-beat transfer width MUST be a real eDMA SSIZE/DSIZE encoding (1/2/4/8/16/32
    // bytes) -- dma_frame_bytes (e.g. 9 for an AD9910 write) is NOT a valid width and an
    // earlier version of this patch wrongly passed it as one. Fixed: beats are always
    // 1 byte wide; dma_frame_bytes instead sets the MINOR LOOP byte count (how many
    // 1-byte beats fire back-to-back per single PIT-sourced DMA request) -- this is the
    // standard eDMA minor-loop/major-loop split, not a workaround.
    edma_transfer_config_t transferConfig;
    EDMA_PrepareTransfer(&transferConfig,
        self->dma_buffer_dcache_aligned, 1,
        (void *)&self->spi_inst->TDR, 1,
        (uint32_t)self->dma_frame_bytes,     // minor loop: one whole frame per QTMR tick
        (uint32_t)total_bytes,               // major loop: whole ring buffer
        kEDMA_MemoryToPeripheral);
    memset(self->dma_edmaTcd, 0, sizeof(edma_tcd_t));
    EDMA_TcdSetTransferConfig(self->dma_edmaTcd, &transferConfig, self->dma_edmaTcd);
    EDMA_TcdEnableInterrupts(self->dma_edmaTcd, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
    EDMA_InstallTCD(DMA0, self->dma_channel, self->dma_edmaTcd);
    EDMA_StartTransfer(&self->dma_edmaHandle);

