A622266/micropython/ports/mimxrt/machine_spi.c
    // Set active BEFORE the synchronous refill calls below, since the refill callback's
    // own dma_periodic_write() calls are gated on this flag.
    self->dma_periodic_active = true;

    // Synchronously populate BOTH ring-buffer halves with real content BEFORE arming the
    // PIT trigger -- bench-found bug (2026-09-07): starting the trigger first and relying
    // on the caller's own refill(0)/refill(1) calls (made AFTER this function returns, as
    // separate Python statements) left a real race. The buffer was still all-zero (from
    // the memset above) when the very first PIT tick(s) fired, sending a malformed
    // all-zero "frame" that AD9910 (or any SPI target with a similar multi-byte-register
    // serial protocol) would misinterpret as addressing the wrong register with the wrong
    // byte count -- exactly the kind of malformed communication cycle the AD9910
    // datasheet documents as permanently desyncing its serial port's byte-boundary
    // tracking until an explicit I/O_RESET pulse. Confirmed on the bench: output was
    // corrupted from essentially the very first capture even with I/O_UPDATE completely
    // disabled and rate_hz slowed to 50kHz -- ruling out a timing-jitter-accumulation
    // explanation (which would predict correct-then-degrading behavior, not immediate
    // failure) and pointing squarely at day-one buffer content instead.
    if (self->dma_refill_callback != MP_OBJ_NULL && self->dma_refill_callback != mp_const_none) {
        mp_call_function_1(self->dma_refill_callback, MP_OBJ_NEW_SMALL_INT(0));
        mp_call_function_1(self->dma_refill_callback, MP_OBJ_NEW_SMALL_INT(1));
    }

    PIT_StartTimer(PIT, SPI_DMA_PIT_CHANNEL);

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_spi_dma_periodic_start_obj, 4, 6, machine_spi_dma_periodic_start);

// spi.dma_periodic_write(half, buf) -- copy buf (must be exactly SPI_DMA_FRAMES_PER_HALF
// * frame_bytes long) into the specified half (0=bottom, 1=top) of the internal ring
// buffer. Intended to be called from the refill_callback passed to
// dma_periodic_start(), using the `half` value that callback was invoked with.
static mp_obj_t machine_spi_dma_periodic_write(mp_obj_t self_in, mp_obj_t half_in, mp_obj_t buf_in) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_int_t half = mp_obj_get_int(half_in);
    if (!self->dma_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("dma_periodic not active"));
    }
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    size_t half_bytes = SPI_DMA_FRAMES_PER_HALF * self->dma_frame_bytes;
    if (buf.len != half_bytes) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer wrong length for one half"));
    }
    uint8_t *dest = self->dma_buffer_dcache_aligned + (half ? half_bytes : 0);
    memcpy(dest, buf.buf, half_bytes);
    // Confirmed necessary by bench test (2026-09-06) -- see dma_periodic_start()'s own
    // comment. Without this, DMA silently keeps reading whatever stale content was in
    // RAM before this call, ignoring every refill.
    DCACHE_CleanByRange((uint32_t)dest, (uint32_t)half_bytes);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(machine_spi_dma_periodic_write_obj, machine_spi_dma_periodic_write);

// Diagnostic-only (2026-09-06): see spi_dma_isr_count's own comment above.
static mp_obj_t machine_spi_dma_periodic_isr_count(mp_obj_t self_in) {
    (void)self_in;
    return mp_obj_new_int_from_uint(spi_dma_isr_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_isr_count_obj, machine_spi_dma_periodic_isr_count);

// Diagnostic-only: see spi_dma_io_update_isr_count's own comment above
// (LPSPI4_IRQHandler).
static mp_obj_t machine_spi_dma_periodic_io_update_isr_count(mp_obj_t self_in) {
    (void)self_in;
    return mp_obj_new_int_from_uint(spi_dma_io_update_isr_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_io_update_isr_count_obj, machine_spi_dma_periodic_io_update_isr_count);

static mp_obj_t machine_spi_dma_periodic_stop(mp_obj_t self_in) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (!self->dma_periodic_active) {
        return mp_const_none;
    }
    EDMA_AbortTransfer(&self->dma_edmaHandle);
    // self->dma_channel is the FIXED SPI_DMA_DMAMUX_CHANNEL, never drawn from
    // allocate_dma_channel()'s pool -- do NOT free_dma_channel() it, that pool doesn't
    // own it and freeing it here would let some unrelated caller's allocate_dma_channel()
    // hand it out later, corrupting this dedicated feature on the next dma_periodic_
    // start() call. Just disable the DMAMUX trigger and LPSPI's own DMA request instead.
    DMAMUX_DisablePeriodTrigger(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    DMAMUX_DisableChannel(DMAMUX, SPI_DMA_DMAMUX_CHANNEL);
    LPSPI_DisableDMA(self->spi_inst, kLPSPI_TxDmaEnable);
    PIT_StopTimer(PIT, SPI_DMA_PIT_CHANNEL);
    // I/O_UPDATE: disable LPSPI4's Frame-Complete interrupt (harmless no-op if
    // dma_periodic_start() was called with io_update_duty_u16 == 0, since it was never
    // enabled). NVIC IRQ itself is left enabled permanently once armed the first time --
    // disabling the interrupt SOURCE here is sufficient, no need to churn EnableIRQ/
    // DisableIRQ on every start/stop cycle.
    LPSPI_DisableInterrupts(self->spi_inst, (uint32_t)kLPSPI_FrameCompleteInterruptEnable);
    self->dma_periodic_active = false;
    self->dma_refill_callback = MP_OBJ_NULL;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_dma_periodic_stop_obj, machine_spi_dma_periodic_stop);

static void machine_spi_deinit_hw(mp_obj_base_t *self_in) {
    machine_spi_dma_periodic_stop(MP_OBJ_FROM_PTR(self_in));
}

// --- Port-specific locals dict: the generic mp_machine_spi_locals_dict (extmod/
// machine_spi.c) has no way to carry these mimxrt-only additions, so this file defines
// its own dict combining the generic entries with the three new methods above, and
// points machine_spi_type at THIS dict instead. The extern declarations below assume
// external linkage for the generic *_obj symbols -- consistent with how
// MP_DEFINE_CONST_FUN_OBJ_* is used elsewhere in this codebase, but NOT bench/build-
// verified for this exact case; a build failure here would mean extmod/machine_spi.c
// needs those symbols marked non-static (a one-line, upstream-friendly fix) rather than
// anything wrong with this file's own logic.
// mp_machine_spi_{read,readinto,write,write_readinto}_obj are already declared (with the
// correct types -- read/readinto as mp_obj_fun_builtin_var_t, write/write_readinto as
// mp_obj_fun_builtin_fixed_t) by extmod/modmachine.h, already transitively included via
// py/runtime.h above -- redeclaring them here with guessed types was a real build error
// (conflicting types for mp_machine_spi_write_obj), not just redundant. Only
// machine_spi_init_obj/machine_spi_deinit_obj need a fresh extern here: modmachine.h
// doesn't declare them (they were static in extmod/machine_spi.c until this patch).
extern const mp_obj_fun_builtin_var_t machine_spi_init_obj;    // MP_DEFINE_CONST_FUN_OBJ_KW
extern const mp_obj_fun_builtin_fixed_t machine_spi_deinit_obj; // MP_DEFINE_CONST_FUN_OBJ_1

// --- ISR-driven periodic SPI (2026-09-07) -- alternative to dma_periodic_start() that
// bypasses DMAMUX/eDMA's periodic-trigger mechanism entirely. Bench testing found that
// mechanism has an inherent, non-eliminable trigger-to-transfer timing-jitter artifact
// (a deterministic "2 tight + 1 loose"-style cyclic pattern) reproduced across every
// rate_hz, DMAMUX channel, and PIT channel tried, corrupting AD9910's serial-port
// framing even though the SPI content itself was proven bit-perfect and the long-run
// average rate was often correct. PIT-driven CPU interrupts, in contrast, are the ONE
// timing mechanism bench-confirmed EXACTLY jitter-free in this file (I/O_UPDATE's own
// timing, before it was replaced by the LPSPI4 Frame-Complete interrupt). This
// mechanism writes each frame's bytes directly to LPSPI's TDR register from the PIT
// ISR, once per configured period, with zero DMA/DMAMUX involvement -- CPU-driven, not
// hardware-autonomous, so it costs real cycles at rate_hz (unlike the DMA approach),
// but sidesteps DMAMUX's demonstrated unreliability entirely.
//
// Uses PIT channel 1 (SPI_ISR_PIT_CHANNEL) -- deliberately NOT channel 0
// (SPI_DMA_PIT_CHANNEL), so this mechanism can coexist with (though is not intended to
// run concurrently with) the existing dma_periodic_* API without a channel conflict.
// Global/static state (not part of machine_spi_obj_t) because the ISR has no way to
// recover a `self` pointer -- matches this file's existing single-instance-only design
// for all its periodic-transfer extensions.
#define SPI_ISR_PIT_CHANNEL kPIT_Chnl_1

// Ring buffer, same double-buffering shape as dma_periodic_start()'s (see its own
// comment) -- two halves, one being drained by the ISR while Python refills the other.
// Unlike that buffer, this one is ONLY ever touched by the CPU (Python-side refill
// writes via isr_periodic_write(), ISR-side reads below) -- no separate DMA bus master
// is involved, so ordinary Cortex-M7 cache coherency between CPU loads/stores already
// applies and no DCACHE_CleanByRange() calls are needed here, unlike the DMA mechanism.
//
// Was 64 until 2026-09-08. Found the hard way with a real weaver_native-driven content
// source: a refill() call that has to compute a fresh DSP block (~2.4ms for
// drivers/weaver_pipeline.py's BLOCK_SIZE=1024) takes far longer than one 64-frame half
// takes to PLAY (64/192kHz = 333us) -- so the double-buffering assumption ("the ISR is
// always reading the OTHER half from the one Python is writing") silently breaks:
// the ISR laps the slow refill and starts reading a half that's still being written,
// a genuine torn read producing a jumbled mix of stale and fresh FTW bytes within one
// playback sequence. This is NOT caught by any per-sample content sanity check (each
// individual value written is perfectly valid; it's the READ-WHILE-WRITE timing that's
// corrupted) and only manifests probabilistically depending on the exact interleaving,
// which is why it took ~3-4 seconds (not immediately) to visibly corrupt AD9910's
// state in that bench test, and why a constant-content refill (no expensive per-call
// compute, always sub-microsecond writes) ran cleanly for 15+ seconds with the exact
// same automatic-I/O_UPDATE mechanism -- ruling out the mechanism itself and pointing
// straight at this half-size-vs-refill-cost mismatch. Bumped to 1024 to match
// weaver_pipeline.py's own BLOCK_SIZE exactly: a half's ~5.33ms playback time then
// comfortably exceeds the ~2.4-2.5ms it takes to compute+pack that same content
// (~2.1x margin), restoring genuine double-buffering. A caller with a cheaper content
// source (like the constant-content tests) is unaffected either way -- this only
// changes how much gets buffered ahead, not correctness for a fast refill.
#define SPI_ISR_FRAMES_PER_HALF (1024)

static volatile bool spi_isr_periodic_active = false;
static size_t spi_isr_frame_bytes = 0;
static uint8_t *spi_isr_buffer = NULL;        // 2 * SPI_ISR_FRAMES_PER_HALF * spi_isr_frame_bytes
static size_t spi_isr_half_bytes = 0;         // SPI_ISR_FRAMES_PER_HALF * spi_isr_frame_bytes
static size_t spi_isr_frames_per_half = 0;    // == SPI_ISR_FRAMES_PER_HALF, cached to
                                               // avoid a division in the ISR hot path
static size_t spi_isr_read_index = 0;         // next FRAME (not byte) to send, wraps at
                                               // 2 * spi_isr_frames_per_half
static LPSPI_Type *spi_isr_lpspi = NULL;
static mp_obj_t spi_isr_refill_callback = MP_OBJ_NULL;
static bool spi_isr_io_update_enabled = false;
volatile uint32_t spi_isr_periodic_count = 0;

// Overrides the .weak default in startup_MIMXRT1062.S. PIT has a single shared IRQ
// vector for all 4 channels (MIMXRT1062.h: "PIT interrupt", not per-channel) -- check
// and clear this specific channel's own flag before acting, in case some other future
// PIT user shares the vector.
void PIT_IRQHandler(void) {
    if ((PIT_GetStatusFlags(PIT, SPI_ISR_PIT_CHANNEL) & (uint32_t)kPIT_TimerFlag) != 0) {
        PIT_ClearStatusFlags(PIT, SPI_ISR_PIT_CHANNEL, (uint32_t)kPIT_TimerFlag);
        // Dummy read-back immediately after the write-1-to-clear write, before doing
        // anything else -- same bug class bench-found and fixed for LPSPI4's
        // Frame-Complete interrupt earlier tonight: the TFLG write is posted on the bus
        // and may not have completed by the time this ISR would otherwise return,
        // letting the NVIC see the flag still asserted and re-enter immediately for the
        // same real timer event. Bench-confirmed here too: without this, the observed
        // TDR-write rate ran at several times the programmed 192kHz (measured ~693kHz
        // against a directly register-verified 192kHz PIT period).
        (void)PIT_GetStatusFlags(PIT, SPI_ISR_PIT_CHANNEL);
        if (spi_isr_periodic_active && spi_isr_lpspi != NULL) {
            // I/O_UPDATE for the PREVIOUS tick's frame, before queuing this tick's new
            // content -- NOT the LPSPI4 Frame-Complete-interrupt approach dma_periodic_
            // start() uses. That approach was bench-tested here (2026-09-07) and, despite
            // proving perfectly correct on every measurable metric (bit-perfect wire
            // content, exact 1:1 I/O_UPDATE-per-frame correlation, correct pacing),
            // produced NO usable RF output at all -- not wrong-frequency, just silent --
            // reproduced even at a much slower 1kHz rate, ruling out "too fast for the
            // DDS." Root cause not understood (possibly a latent issue in the shared FCF
            // mechanism itself, never actually validated against real RF output before
            // since dma_periodic_start()'s own DMAMUX jitter always masked it). Falling
            // back to the simpler, ALREADY-proven-correct approach instead: this ISR
            // fires once every full frame period (5.2us at 192kHz), comfortably longer
            // than one 9-byte frame's ~4.27us shift time, so by construction the frame
            // queued on the PREVIOUS tick has always finished shifting out completely by
            // now, before any of THIS tick's new content is written -- pulsing here, in
            // that guaranteed-idle gap, latches it safely without needing a second
            // interrupt source or any assumption about FCF timing at all.
            if (spi_isr_io_update_enabled) {
                SPI_DMA_IO_UPDATE_GPIO_BASE->DR_SET = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
                // See LPSPI4_IRQHandler's own comment on why no explicit delay is needed
                // between DR_SET and DR_CLEAR: AD9910's I/O_UPDATE minimum pulse width
                // (">1 SYNC_CLK cycle", a handful of ns) is far shorter than the
                // instructions between these two writes already take at 600MHz.
                SPI_DMA_IO_UPDATE_GPIO_BASE->DR_CLEAR = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
            }

            // Pack the current ring-buffer frame into ceil(frame_bytes*8/32) genuine
            // 32-bit WORDS and write TDR exactly that many times -- NOT once per
            // content byte. See the fork's commit history (621030168) for the full
            // story: an earlier per-byte-write version supplied enough FIFO pushes for
            // 3 whole frames per real ISR call (LPSPI's push counter advances once per
            // WRITE OPERATION to TDR, not once per byte), so it free-ran at LPSPI's own
            // max throughput regardless of the ISR's true, correctly-paced rate. Fixed
            // by pushing real 32-bit words (MSB-first per word, matching the i.MX RT1060
            // RM's own multi-word FRAMESZ>32 example; a short final word is
            // right-justified) -- one push per FIFO word, not one push per content byte.
            uint8_t *frame = spi_isr_buffer + spi_isr_read_index * spi_isr_frame_bytes;
            size_t nbytes = spi_isr_frame_bytes;
            size_t i = 0;
            while (i < nbytes) {
                size_t chunk = nbytes - i;
                if (chunk > 4) {
                    chunk = 4;
                }
                uint32_t word = 0;
                for (size_t j = 0; j < chunk; j++) {
                    word = (word << 8) | frame[i + j];
                }
                spi_isr_lpspi->TDR = word;
                i += chunk;
            }
            spi_isr_periodic_count++;

