A622266/micropython/ports/mimxrt/machine_spi.c
            // Advance the ring-buffer read position and, when a half boundary was just
            // crossed, tell Python (via mp_sched_schedule -- runs on the main thread,
            // not IRQ context, same as edma_spi_periodic_callback()'s own convention)
            // which half needs fresh content. Report the half that needs refilling, not
            // the one that just played -- matches dma_periodic's own callback contract
            // exactly, so a caller can share refill logic between both mechanisms.
            size_t prev_index = spi_isr_read_index;
            spi_isr_read_index++;
            if (spi_isr_read_index >= 2 * spi_isr_frames_per_half) {
                spi_isr_read_index = 0;
            }
            if (spi_isr_refill_callback != MP_OBJ_NULL && spi_isr_refill_callback != mp_const_none) {
                if (prev_index == spi_isr_frames_per_half - 1) {
                    mp_sched_schedule(spi_isr_refill_callback, MP_OBJ_NEW_SMALL_INT(0));
                } else if (prev_index == 2 * spi_isr_frames_per_half - 1) {
                    mp_sched_schedule(spi_isr_refill_callback, MP_OBJ_NEW_SMALL_INT(1));
                }
            }
        }
    }
}

// spi.isr_periodic_start(frame_bytes, rate_hz, refill_callback, io_update_enable=0)
//
// Same double-buffered-ring-buffer shape as dma_periodic_start() (see its own comment):
// `refill_callback(half)` is scheduled each time a half-buffer has just been drained
// and needs fresh frames written into it via isr_periodic_write(half, buf) -- lets
// Python (or, eventually, the weaver_native C module) hand over a genuinely time-
// varying stream of DDS register content in batches (~64 frames at a time, refilled
// roughly every 64/rate_hz seconds -- comfortably slow enough for MicroPython), instead
// of the previous single-static-frame design, which could only repeat one frame
// indefinitely or be occasionally, expensively swapped from Python.
//
// `io_update_enable`: if truthy, reuses dma_periodic_start()'s own I/O_UPDATE mechanism
// (LPSPI4_IRQHandler, pulsing D15 on LPSPI's own Frame-Complete flag) rather than
// inventing a second, ISR-tick-relative timing scheme -- that interrupt fires whenever
// LPSPI reports a real frame actually finished (PCS negated), regardless of whether
// CPU-ISR writes (this mechanism) or eDMA (dma_periodic_start()) fed TDR, so it's
// correct by construction for either. NOT yet bench-validated end-to-end with a live,
// per-frame-varying content stream -- only with occasional, slowly-changing content (see
// firmware/spi_dma_periodic_patch/README.md's pipeline-latency measurement).
static mp_obj_t machine_spi_isr_periodic_start(size_t n_args, const mp_obj_t *args) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    mp_int_t frame_bytes = mp_obj_get_int(args[1]);
    mp_int_t rate_hz = mp_obj_get_int(args[2]);
    mp_obj_t refill_callback = args[3];
    mp_int_t io_update_enable = (n_args > 4) ? mp_obj_get_int(args[4]) : 0;

    if (frame_bytes <= 0 || frame_bytes > 16) {
        mp_raise_ValueError(MP_ERROR_TEXT("frame_bytes out of range"));
    }
    if (spi_isr_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("isr_periodic already active"));
    }

    spi_isr_frame_bytes = (size_t)frame_bytes;
    spi_isr_frames_per_half = SPI_ISR_FRAMES_PER_HALF;
    spi_isr_half_bytes = spi_isr_frames_per_half * spi_isr_frame_bytes;
    size_t total_bytes = 2 * spi_isr_half_bytes;
    spi_isr_buffer = m_new(uint8_t, total_bytes);
    memset(spi_isr_buffer, 0, total_bytes);
    spi_isr_read_index = 0;
    spi_isr_refill_callback = refill_callback;
    spi_isr_lpspi = self->spi_inst;

    // Widen FRAMESZ -- same read-modify-write precondition as dma_periodic_start() (at
    // least one prior blocking spi.write()/write_readinto() must have already run on
    // this object, establishing TCR's CPOL/CPHA/byte-order baseline).
    uint32_t frame_bits = (uint32_t)frame_bytes * 8;
    self->spi_inst->TCR = (self->spi_inst->TCR & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_FRAMESZ(frame_bits - 1);

    pit_config_t pit_config;
    PIT_GetDefaultConfig(&pit_config);
    PIT_Init(PIT, &pit_config);
    uint32_t perclk_hz = CLOCK_GetPerClkFreq();
    uint32_t pit_ticks = perclk_hz / (uint32_t)rate_hz;
    if (pit_ticks == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("rate_hz too high to represent on PIT"));
    }
    PIT_SetTimerPeriod(PIT, SPI_ISR_PIT_CHANNEL, pit_ticks);

    // I/O_UPDATE on D15, pulsed directly from PIT_IRQHandler itself (see its own
    // comment) -- NOT via LPSPI4's Frame-Complete interrupt the way dma_periodic_start()
    // does it. That approach was tried first and bench-tested here (2026-09-07): it
    // proved perfectly correct on every measurable metric (bit-perfect wire content,
    // exact 1:1 I/O_UPDATE-per-frame correlation, correct pacing) yet produced NO usable
    // RF output at all, even at a much slower 1kHz rate -- root cause not understood,
    // possibly a latent issue in that shared FCF mechanism itself, which was never
    // actually validated against real RF output before (dma_periodic_start()'s own
    // DMAMUX jitter always masked it). This just sets up the GPIO pin here; the actual
    // pulsing happens once per ISR tick, for the previous tick's already-fully-shifted
    // frame.
    spi_isr_io_update_enabled = (io_update_enable != 0);
    if (spi_isr_io_update_enabled) {
        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U);
        IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19,
            pin_generate_config(PIN_PULL_UP_100K, PIN_MODE_OUT, DEFAULT_SPI_DRIVE, 0x401F82F8U));
        SPI_DMA_IO_UPDATE_GPIO_BASE->GDIR |= (1u << SPI_DMA_IO_UPDATE_GPIO_BIT);
        SPI_DMA_IO_UPDATE_GPIO_BASE->DR_CLEAR = (1u << SPI_DMA_IO_UPDATE_GPIO_BIT); // start low
    }

    // Set active BEFORE the synchronous refill calls below, matching dma_periodic_
    // start()'s own ordering (its refill callback's dma_periodic_write() calls are
    // gated on the "active" flag; isr_periodic_write() is gated the same way here).
    spi_isr_periodic_active = true;

