A622266/micropython/ports/mimxrt/machine_spi.c
    // Synchronously populate BOTH ring-buffer halves with real content BEFORE arming
    // the PIT trigger -- same bench-found race dma_periodic_start() already had to fix
    // (see its own comment): starting the timer first and relying on the caller's
    // refill(0)/refill(1) calls running later, as separate Python statements after this
    // function returns, would let the first PIT tick(s) send the all-zero memset
    // content.
    if (spi_isr_refill_callback != MP_OBJ_NULL && spi_isr_refill_callback != mp_const_none) {
        mp_call_function_1(spi_isr_refill_callback, MP_OBJ_NEW_SMALL_INT(0));
        mp_call_function_1(spi_isr_refill_callback, MP_OBJ_NEW_SMALL_INT(1));
    }

    PIT_EnableInterrupts(PIT, SPI_ISR_PIT_CHANNEL, (uint32_t)kPIT_TimerInterruptEnable);
    EnableIRQ(PIT_IRQn);
    PIT_StartTimer(PIT, SPI_ISR_PIT_CHANNEL);

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_spi_isr_periodic_start_obj, 4, 5, machine_spi_isr_periodic_start);

// spi.isr_periodic_write(half, buf) -- copy buf (must be exactly
// SPI_ISR_FRAMES_PER_HALF * frame_bytes long) into the specified half (0=bottom,
// 1=top) of the internal ring buffer. Intended to be called from the refill_callback
// passed to isr_periodic_start(), using the `half` value that callback was invoked
// with -- mirrors dma_periodic_write()'s API exactly (no DCACHE call needed here, see
// the ring-buffer comment above).
static mp_obj_t machine_spi_isr_periodic_write(mp_obj_t self_in, mp_obj_t half_in, mp_obj_t buf_in) {
    (void)self_in;
    mp_int_t half = mp_obj_get_int(half_in);
    if (!spi_isr_periodic_active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("isr_periodic not active"));
    }
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    if (buf.len != spi_isr_half_bytes) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer wrong length for one half"));
    }
    // Briefly disable the PIT interrupt to make the buffer swap atomic (avoid the ISR
    // reading a torn write mid-copy) -- cheap and brief (a ~576-byte memcpy at 600MHz),
    // and the caller is expected to refill the half the ISR just finished draining
    // (i.e. NOT the half it's currently reading from), so this is a defensive measure,
    // not a load-bearing assumption.
    PIT_DisableInterrupts(PIT, SPI_ISR_PIT_CHANNEL, (uint32_t)kPIT_TimerInterruptEnable);
    uint8_t *dest = spi_isr_buffer + (half ? spi_isr_half_bytes : 0);
    memcpy(dest, buf.buf, spi_isr_half_bytes);
    PIT_EnableInterrupts(PIT, SPI_ISR_PIT_CHANNEL, (uint32_t)kPIT_TimerInterruptEnable);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(machine_spi_isr_periodic_write_obj, machine_spi_isr_periodic_write);

static mp_obj_t machine_spi_isr_periodic_stop(mp_obj_t self_in) {
    (void)self_in;
    if (!spi_isr_periodic_active) {
        return mp_const_none;
    }
    spi_isr_periodic_active = false;
    PIT_StopTimer(PIT, SPI_ISR_PIT_CHANNEL);
    PIT_DisableInterrupts(PIT, SPI_ISR_PIT_CHANNEL, (uint32_t)kPIT_TimerInterruptEnable);
    spi_isr_io_update_enabled = false;
    spi_isr_lpspi = NULL;
    spi_isr_refill_callback = MP_OBJ_NULL;
    spi_isr_buffer = NULL;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_isr_periodic_stop_obj, machine_spi_isr_periodic_stop);

static mp_obj_t machine_spi_isr_periodic_count(mp_obj_t self_in) {
    (void)self_in;
    return mp_obj_new_int_from_uint(spi_isr_periodic_count);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_spi_isr_periodic_count_obj, machine_spi_isr_periodic_count);

static const mp_rom_map_elem_t machine_spi_mimxrt_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_spi_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_spi_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&mp_machine_spi_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_spi_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_spi_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_write_readinto), MP_ROM_PTR(&mp_machine_spi_write_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_MSB), MP_ROM_INT(MICROPY_PY_MACHINE_SPI_MSB) },
    { MP_ROM_QSTR(MP_QSTR_LSB), MP_ROM_INT(MICROPY_PY_MACHINE_SPI_LSB) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_start), MP_ROM_PTR(&machine_spi_dma_periodic_start_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_write), MP_ROM_PTR(&machine_spi_dma_periodic_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_stop), MP_ROM_PTR(&machine_spi_dma_periodic_stop_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_isr_count), MP_ROM_PTR(&machine_spi_dma_periodic_isr_count_obj) },
    { MP_ROM_QSTR(MP_QSTR_dma_periodic_io_update_isr_count), MP_ROM_PTR(&machine_spi_dma_periodic_io_update_isr_count_obj) },
    { MP_ROM_QSTR(MP_QSTR_isr_periodic_start), MP_ROM_PTR(&machine_spi_isr_periodic_start_obj) },
    { MP_ROM_QSTR(MP_QSTR_isr_periodic_write), MP_ROM_PTR(&machine_spi_isr_periodic_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_isr_periodic_stop), MP_ROM_PTR(&machine_spi_isr_periodic_stop_obj) },
    { MP_ROM_QSTR(MP_QSTR_isr_periodic_count), MP_ROM_PTR(&machine_spi_isr_periodic_count_obj) },
};
MP_DEFINE_CONST_DICT(mp_machine_spi_mimxrt_locals_dict, machine_spi_mimxrt_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    make_new, machine_spi_make_new,
    print, machine_spi_print,
    protocol, &machine_spi_p,
    locals_dict, &mp_machine_spi_mimxrt_locals_dict
    );
